Autodesk.Revit.DB.FilterInverseRule.SetInnerRule(Autodesk.Revit.DB.FilterRule)
Gets the rule being inverted.
innerRule:
The rule to invert.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterInverseRule.GetInnerRule
Gets the rule being inverted.
Since:
2011

Autodesk.Revit.DB.FilterInverseRule.#ctor(Autodesk.Revit.DB.FilterRule)
Constructs a new instance of FilterInverseRule.
innerRule:
The rule to invert.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterInverseRule
A filter rule that inverts the boolean values returned by the rule it contains.
Remarks:
FilterInverse rule performs a logical "not" operation on its inner rule's
"elementPasses()" method.
Since:
2011